#Primitive Data Typ
#Number , Boolean ,String

#Non-Primitive Data Type // Collection / Data Structure ข้อมูลชนิดไม่พื้นฐาน
#List , Tuple , Set , Dictionary

#Data Type จะเอามาใช้กับการเขียนโปรแกรมในเรื่องของ ตัวแปร พารามิเตอร์ ฟังก์ชัน เมธอด

#--------------------List ข้อมูลหลายข้อมูล คนละชนิดได้ ซ้ำกันได้และมีลำดับ อีกทั้งแก้ไขได้ด้วย------------------------
#          0   1  2    3   4         5
my_list1=[110,20,True,10,'SAU',[20,'IOT']]
#         6   5   4   3   2        1    ติด-
#--------------------Tuple ข้อมูลหลายข้อมูล คนละชนิดได้ ซ้ำกันได้และมีลำดับ แต่แก้ไขไม่ได้ เพิ่มหรือลบก็ไม่ได้------------------------
#          0   1  2    3   4         5
my_tuple1=(110,20,True,10,'SAU',(20,'IOT'))
#         6   5   4   3   2        1    ติด-
#--------------------Set ข้อมูลหลายข้อมูล คนละชนิดได้ ซ้ำกันไม่ได้(ถือว่่าตัวซ้ำเป็นตัวเดียวกัน)และไม่มีลำดับ อีกทั้งแก้ไขไม่ได้ แต่เพิ่มหรือลบได้------------------------
my_set1={110,20,True,10,'SAU',(20,'IOT')}
